<h1 style= "text-align= center;"> blah blah blah <h1>

In [15]:
import pandas as pd 
import math as math 
import matplotlib.pyplot as plt 
import numpy as np

In [16]:
# Here are some imports we'll use through the notebook, collected here for simplicity

# For parsing dates and being able to compare
import datetime

# For fetching remote data
import urllib

# Pandas dataframes and operations
import pandas as pd

# Numpy matrix and array operations
import numpy as np

# Sqlite is a simplistic database
import sqlite3

# Data visualization
import matplotlib

#HAD ISSUES INSTALLING # Crawler for multiple web pages at once
#import scrapy
#from scrapy.crawler import CrawlerProcess
# Can use dataframe.swifter.apply() instead of dataframe.apply()
# to try to parallelize the computation!
#import swifter
# Approximate string matching, see 
#import py_stringsimjoin as ssj
#import py_stringmatching as sm
# import urllib and etree for download and parsing
#from lxml import etree

In [17]:
data = pd.read_csv('data.csv', delimiter=',')
# DELIMITER WHAT SEPERATES THE DATA (;)

print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [18]:
data_2 = pd.read_csv('CityState.csv', delimiter=',', engine='python', encoding='latin1')

In [19]:
data.head(8000)

,rankingNoteText,nonResponderText,nonResponder,act-avg,primaryPhoto,primaryPhotoThumb,sat-avg,enrollment,city,sortName,...,displayName,schoolType,region,aliasNames,rankingType,overallRank,institutionalControl,rankingMaxPossibleScore,rankingRankStatus,primaryKey
0,NaN,NaN,False,32.0,https://www.usnews.com/img/college-photo_31291...,https://www.usnews.com/img/college-photo_31291...,1400.0,5400.0,Princeton,princetonuniversity,...,Princeton University,national-universities,NaN,NaN,national-universities,1,private,NaN,ranked,2627
1,NaN,NaN,False,32.0,https://www.usnews.com/img/college-photo_8866.jpg,https://www.usnews.com/img/college-photo_8866_...,1430.0,6710.0,Cambridge,harvarduniversity,...,Harvard University,national-universities,NaN,NaN,national-universities,2,private,NaN,ranked,2155
2,NaN,NaN,False,32.0,https://www.usnews.com/dims4/USNEWS/5b128f0/17...,https://www.usnews.com/dims4/USNEWS/196469f/17...,1450.0,5941.0,Chicago,universityofchicago,...,University of Chicago,national-universities,NaN,UChicago,national-universities,3,private,NaN,ranked,1774
3,NaN,NaN,False,32.0,https://www.usnews.com/dims4/USNEWS/60348dd/17...,https://www.usnews.com/dims4/USNEWS/1ca230f/17...,1420.0,5472.0,New Haven,yaleuniversity,...,Yale University,national-universities,NaN,NaN,national-universities,3,private,NaN,ranked,1426
4,NaN,NaN,False,32.0,https://www.usnews.com/img/college-photo_19002...,https://www.usnews.com/img/college-photo_19002...,1430.0,6113.0,New York,columbiauniversity,...,Columbia University,national-universities,NaN,NaN,national-universities,5,private,NaN,ranked,2707
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
306,NaN,School refused to fill out U.S. News statistic...,True,NaN,NaN,NaN,NaN,NaN,Cypress,tridentuniversityinternational,...,Trident University International,national-universities,NaN,NaN,national-universities,-2,proprietary,NaN,ur,41279
307,NaN,School refused to fill out U.S. News statistic...,True,NaN,https://www.usnews.com/img/college-photo_14624...,https://www.usnews.com/img/college-photo_14624...,NaN,NaN,Cincinnati,unioninstituteanduniversity,...,Union Institute and University,national-universities,NaN,NaN,national-universities,-2,private,NaN,ur,10923
308,NaN,School refused to fill out U.S. News statistic...,True,NaN,NaN,NaN,NaN,NaN,Phoenix,universityofphoenix,...,University of Phoenix,national-universities,NaN,NaN,national-universities,-2,proprietary,NaN,ur,209885
309,NaN,School refused to fill out U.S. News statistic...,True,NaN,NaN,NaN,NaN,NaN,Minneapolis,waldenuniversity,...,Walden University,national-universities,NaN,NaN,national-universities,-2,proprietary,NaN,ur,25042
310,NaN,NaN,False,NaN,NaN,NaN,NaN,8873.0,New Castle,wilmingtonuniversity,...,Wilmington University,national-universities,NaN,NaN,national-universities,-2,private,NaN,ur,7948

In [20]:
print(data.columns)
print(data.keys())

Index(['rankingNoteText', 'nonResponderText', 'nonResponder', 'act-avg',
       'primaryPhoto', 'primaryPhotoThumb', 'sat-avg', 'enrollment', 'city',
       'sortName', 'zip', 'rankingNoteCharacter', 'acceptance-rate',
       'rankingDisplayScore', 'percent-receiving-aid', 'cost-after-aid',
       'state', 'rankingSortRank', 'hs-gpa-avg', 'urlName',
       'rankingDisplayName', 'rankingDisplayRank', 'ranking', 'xwalkId',
       'rankingIsTied', 'isPublic', 'businessRepScore', 'tuition',
       'engineeringRepScore', 'displayName', 'schoolType', 'region',
       'aliasNames', 'rankingType', 'overallRank', 'institutionalControl',
       'rankingMaxPossibleScore', 'rankingRankStatus', 'primaryKey'],
      dtype='object')
Index(['rankingNoteText', 'nonResponderText', 'nonResponder', 'act-avg',
       'primaryPhoto', 'primaryPhotoThumb', 'sat-avg', 'enrollment', 'city',
       'sortName', 'zip', 'rankingNoteCharacter', 'acceptance-rate',
       'rankingDisplayScore', 'percent-receiving-aid', 'cost-after-aid',
       'state', 'rankingSortRank', 'hs-gpa-avg', 'urlName',
       'rankingDisplayName', 'rankingDisplayRank', 'ranking', 'xwalkId',
       'rankingIsTied', 'isPublic', 'businessRepScore', 'tuition',
       'engineeringRepScore', 'displayName', 'schoolType', 'region',
       'aliasNames', 'rankingType', 'overallRank', 'institutionalControl',
       'rankingMaxPossibleScore', 'rankingRankStatus', 'primaryKey'],
      dtype='object')

In [21]:
columns_list = ['city', 'state', 'displayName','cost-after-aid']
row = list(range(7000))
new_data = pd.DataFrame(data, index=row, columns=columns_list)
new_data.head(7000)

           city state            displayName  cost-after-aid
0     Princeton    NJ   Princeton University         16793.0
1     Cambridge    MA     Harvard University         16338.0
2       Chicago    IL  University of Chicago         27767.0
3     New Haven    CT        Yale University         18385.0
4      New York    NY    Columbia University         21041.0
...         ...   ...                    ...             ...
6995        NaN   NaN                    NaN             NaN
6996        NaN   NaN                    NaN             NaN
6997        NaN   NaN                    NaN             NaN
6998        NaN   NaN                    NaN             NaN
6999        NaN   NaN                    NaN             NaN

[7000 rows x 4 columns]

In [22]:
columns_list = ['City', 'State_ab', 'Mean']
row = list(range(7000))
new_data = pd.DataFrame(data_2, index=row, columns=columns_list)
new_data.head(7000)

                City State_ab    Mean
0          Chickasaw       AL   38773
1         Louisville       AL   37725
2         Columbiana       AL   54606
3            Satsuma       AL   63919
4     Dauphin Island       AL   77948
...              ...      ...     ...
6995   Pompano Beach       FL   50778
6996     Dania Beach       FL   69836
6997   Coral Springs       FL  150858
6998   Coral Springs       FL  119477
6999   Coconut Creek       FL   47168

[7000 rows x 3 columns]

In [26]:
# Let's take a look at the name and born data in exec_df.  We do this via projection.  
# Notice also (e.g. row 24) that special characters will cause issues.


data[['city', 'state', 'displayName','cost-after-aid']]

            city state                       displayName  cost-after-aid
0      Princeton    NJ              Princeton University         16793.0
1      Cambridge    MA                Harvard University         16338.0
2        Chicago    IL             University of Chicago         27767.0
3      New Haven    CT                   Yale University         18385.0
4       New York    NY               Columbia University         21041.0
..           ...   ...                               ...             ...
306      Cypress    CA  Trident University International             NaN
307   Cincinnati    OH    Union Institute and University             NaN
308      Phoenix    AZ             University of Phoenix             NaN
309  Minneapolis    MN                 Walden University             NaN
310   New Castle    DE             Wilmington University             NaN

[311 rows x 4 columns]

In [27]:
data_2[['City', 'State_ab', 'Mean']]

                 City State_ab   Mean
0           Chickasaw       AL  38773
1          Louisville       AL  37725
2          Columbiana       AL  54606
3             Satsuma       AL  63919
4      Dauphin Island       AL  77948
...               ...      ...    ...
32521        Guaynabo       PR  30649
32522          Aguada       PR  15520
32523          Aguada       PR  41933
32524          Aguada       PR      0
32525       Aguadilla       PR  28049

[32526 rows x 3 columns]